Revit 2027 API
FabricationConnectorInfo.IsValid Method
 Checks if the connector has fabrication parameters associated with it that can be set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the connector has fabrication parameters associated with it that can be set.
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace